package ru.greenbudgie.tutorial;

public class TutorialMessages {

    public static final String GENERAL_INFO = "Ultra Hardcore (битва инвалидов) - это режим, в котором все игроки " +
            "телепортируются в случайно сгенерированный мир с одной задачей - выжить. " +
            "Главная фича режима в том, что здоровье не регенерируется самостоятельно. Для его регенерации можно " +
            "использовать золотые яблоки, супы из ромашек, или даже попробовать сделать зелье регенерации (но " +
            "это очень сложно). Побеждает последний выживший игрок или команда. В стандартном " +
            "режиме у игроков 15 минут на развитие без ПВП, а потом еще 55 минут со включенным ПВП. По истечении этого " +
            "времени все выжившие телепортируются на арену для финального дезматча!";

    public static final String MUTATOR_INFO = "Мутаторы вносят изменения в ход игры. Например, они могут увеличить " +
            "урон или сделать воду токсичной. Мутаторы выпадают перед началом игры в количестве от 2-х до 4-х. " +
            "Посмотреть список мутаторов можно с помощью таблички в лобби или через /mutator. Также данная команда " +
            "выводит список активных мутаторов, когда использована во время игры. В лобби можно голосовать за" +
            "понравившиеся мутаторы в их меню, просто кликая на них. Чем больше игроков проголосовало за мутатор - тем" +
            "выше у него будет шанс выпадения в игре.";

    public static final String ARTIFACT_INFO = "Темные артефакты позволяют игрокам активировать различные события во " +
            "время игры. Например, можно поменять ночь на день или нанести урон всем игрокам в игре. " +
            "Артефакты выпадают с каждого убитого игроком враждебного моба. Чтобы открыть меню артефактов " +
            "в игре, нужно нажать ПКМ с ним в руке. Для призыва события требуется определенное количество артефактов " +
            "в инвентаре. Некоторые артефакты немного дорожают за каждое их применение! Посмотреть список всех сил" +
            "артефактов в лобби можно кликнув по табличке или через /artifacts.";

    public static final String REQUEST_INFO = "Запросы позволяют игрокам получать полезные вещи в виде посылки с неба " +
            "за определенную валюту - редстоун и лазурит. Все вещи в запросах имеют различные свойства и их не " +
            "получить больше никаким образом! Чтобы посмотреть на эти вещи в лобби, можно ткнуть по табличке или " +
            "написать /requests. Чтобы сделать запрос в игре, нужно кликнуть ПКМ с редстоуном в руке. " +
            "Поскольку запросы прибывают с воздуха, их необходимо делать под открытым небом, а значит придется " +
            "вылезать из пещеры наружу. Но есть одна фича: в аду запросы можно делать в любом месте.";

    public static final String DEATHMATCH_INFO = "Дезматч проходит на случайно выбранной арене. На арене можно " +
            "разливать лаву и воду, а также поджигать и тушить землю, но вот ломать и ставить блоки нелья " +
            "(даже верстаки). На аренах продолжают действовать мутаторы, а также можно использовать некоторые артефакты " +
            "(какие - написано в меню артефактов).";

    public static final String DROP_INFO = "Через определенное время в различных местах мира появляется " +
            "случайный полезный лут, например золотые яблоки, алмазы, зачарованные вещи и так далее. Есть три " +
            "категории дропов - эирдроп, кейвдроп и эирдроп. Эирдроп появляется на поверхности каждые 10 минут и " +
            "состоит из 1-го предмета. Кейвдроп появляется раз в 12 минут в виде сундука под землей и также состоит " +
            "из одного основного премета, и нескольких отчасти полезных филлеров по типу еды, перьев, ниток и так далее. " +
            "Незердроп появляется в аду выше уровня лавы раз в 20 минут, и содержит целых 2 крутых предмета и немного " +
            "дополнительных полезных вещей, по типу адских бородавок, порошка блейзов, золота и так далее. " +
            "Время, координаты и дистанция до дропов всегда видны в списке справа во время игры. Посмотреть " +
            "предметы, которые могут выпасть, можно кликнув по табличке или через /drops.";

    public static final String NETHER_INFO = "В игре доступна телепортация в Ад, но при этом координаты не делятся и " +
            "не умножаются на 8, как в обычной игре. Из-за этого порталы разных игроков гораздо реже соединяются в " +
            "один. Поскольку стандартная торговля с Пиглинами довольно бесполезна в рамках UHC, все трейды были " +
            "переработаны. Новые предметы у Пиглинов можно посмотреть, кликнув по табличке или через /barters.";

}
